berab/stm32_make_template/AI/scripts/N6_encrypt/c/Weights_encryption/FSBL/Core/Src/npu_cache.c
/**
  ******************************************************************************
  * @file    npu_cache.c
  * @brief   Implementation of NPU-cache-handling functions (CACHEAXI)
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include "npu_cache.h"
#include "stm32n6xx_hal_cacheaxi.h"
#include "ll_aton_config.h"

#if (LL_ATON_PLATFORM != LL_ATON_PLAT_STM32N6)
#error "LL_ATON_PLATFORM should be equal to LL_ATON_PLAT_STM32N6"
#endif

static CACHEAXI_HandleTypeDef hcacheaxi_s;

static inline void npu_cache_init(void)
{
  if(hcacheaxi_s.Instance != CACHEAXI) {
    hcacheaxi_s.Instance = CACHEAXI;
    HAL_CACHEAXI_Init(&hcacheaxi_s);      // Side effect: cacheaxi should be enabled (but one should call npu_enable_cache to be sure)
  }
}

void npu_cache_enable(void)
{
  HAL_StatusTypeDef status;
  
  npu_cache_init();
  // Enable is wrapped in a loop because most of times, the first call returns
  //    HAL_BUSY, resulting in a cache not enabled.
  do
  {
    status = HAL_CACHEAXI_Enable(&hcacheaxi_s);
  } while (status == HAL_BUSY);
}

void npu_cache_disable(void)
{
  HAL_StatusTypeDef status;
  
  npu_cache_init();
  do
  {
    status = HAL_CACHEAXI_Disable(&hcacheaxi_s);
  } while (status == HAL_BUSY);
}

void npu_cache_invalidate(void)
{
  npu_cache_init();
  HAL_CACHEAXI_Invalidate(&hcacheaxi_s);
}

void npu_cache_clean_range(uint32_t start_addr, uint32_t end_addr)
{
  npu_cache_init();
  HAL_CACHEAXI_CleanByAddr(&hcacheaxi_s, (uint32_t*)start_addr, end_addr-start_addr);
}

void npu_cache_clean_invalidate_range(uint32_t start_addr, uint32_t end_addr)
{
  npu_cache_init();
  HAL_CACHEAXI_CleanInvalidByAddr(&hcacheaxi_s, (uint32_t*)start_addr, end_addr-start_addr);
}
